#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
proxmox_lxc.k3s-lb-2: Refreshing state... [id=milky-carina/lxc/12002]
proxmox_lxc.k3s-lb-3: Refreshing state... [id=milky-polaris/lxc/12003]
proxmox_lxc.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-carina/lxc/2004]
proxmox_lxc.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-polaris/lxc/2007]
proxmox_vm_qemu.k3s-manager-worker-1: Refreshing state... [id=milky-carina/qemu/11000]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-carina/qemu/1000]
proxmox_vm_qemu.k3s-manager-controller-3: Refreshing state... [id=milky-polaris/qemu/10002]
proxmox_vm_qemu.k8s-play-worker: Refreshing state... [id=milky-polaris/qemu/32000]
proxmox_vm_qemu.k8s-play-controller: Refreshing state... [id=milky-polaris/qemu/31000]
proxmox_vm_qemu.k3s-manager-controller-2: Refreshing state... [id=milky-carina/qemu/10001]
proxmox_vm_qemu.k3s-manager-controller-1: Refreshing state... [id=milky-carina/qemu/10000]
proxmox_vm_qemu.k3s-manager-worker-3: Refreshing state... [id=milky-carina/qemu/11002]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-polaris/qemu/2006]
proxmox_vm_qemu.k3s-manager-worker-2: Refreshing state... [id=milky-polaris/qemu/11001]
proxmox_vm_qemu.k8s-play-manager-ansible-host: Refreshing state... [id=milky-carina/qemu/30000]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # proxmox_lxc.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-2" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-carina/lxc/2004"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-3" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-polaris/lxc/2007"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-lb-2 will be updated in-place
  ~ resource "proxmox_lxc" "k3s-lb-2" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-carina/lxc/12002"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-lb-3 will be updated in-place
  ~ resource "proxmox_lxc" "k3s-lb-3" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-polaris/lxc/12003"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-nfs will be created
  + resource "proxmox_lxc" "k3s-nfs" {
      + arch         = "amd64"
      + clone        = "9102"
      + cmode        = "tty"
      + console      = true
      + cores        = 1
      + cpulimit     = 0
      + cpuunits     = 1024
      + description  = "cloudflare tunnel for Solufit"
      + hostname     = "solufit-k3s-nfs"
      + id           = (known after apply)
      + memory       = 256
      + onboot       = true
      + ostype       = (known after apply)
      + pool         = "solufit"
      + protection   = false
      + start        = true
      + swap         = 0
      + tags         = (known after apply)
      + target_node  = "milky-polaris"
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = 12004

      + network {
          + bridge   = "k3s"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "10.100.0.9/24"
          + name     = "eth0"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr2"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "dhcp"
          + mtu      = 1400
          + name     = "eth1"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }

      + rootfs {
          + size    = "8G"
          + storage = "main-storage"
          + volume  = (known after apply)
        }
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/2006"
        name                   = "solufit-cloudflare-tunnel-4"
        tags                   = null
        # (71 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/1000"
        name                   = "k3s-ansible-host"
        tags                   = null
        # (53 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-1" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/10000"
        name                   = "solufit-k3s-controller-1"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-2" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/10001"
        name                   = "solufit-k3s-controller-2"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-3" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/10002"
        name                   = "solufit-k3s-controller-3"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-1" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/11000"
        name                   = "solufit-k3s-worker-1"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-2" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/11001"
        name                   = "solufit-k3s-worker-2"
        tags                   = null
        # (52 unchanged attributes hidden)

      ~ disks {
          + virtio {
            }

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-3" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/11002"
        name                   = "solufit-k3s-worker-3"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s-play-controller will be updated in-place
  ~ resource "proxmox_vm_qemu" "k8s-play-controller" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/31000"
        name                   = "solufit-k8s-playground-controller"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s-play-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k8s-play-manager-ansible-host" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-carina/qemu/30000"
        name                   = "k8s-play-ansible-host"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (49 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s-play-worker will be updated in-place
  ~ resource "proxmox_vm_qemu" "k8s-play-worker" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/32000"
        name                   = "solufit-k8s-playground-worker"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 15 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*